app/controllers/tweeets_controller.rb

SELECT "tweeets".* FROM "tweeets" ORDER BY created_at DESC
---
  def index
    @tweeets = Tweeet.all.order("created_at DESC")

INSERT INTO "tweeets" ("Tweeet", "created_at", "updated_at") VALUES (?, ?, ?)  [["Tweeet", "fdsfdsfds"], ["created_at", "2020-12-23 09:31:30.510600"], ["updated_at", "2020-12-23 09:31:30.510600"]]
---
  def create
    @tweeet = Tweeet.new(tweeet_params)

    respond_to do |format|
      if @tweeet.save

SELECT "tweeets".* FROM "tweeets" WHERE "tweeets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tweeet
      @tweeet = Tweeet.find(params[:id])